Repository: Zfinix/flutter_challenge
Catalog: lib/l10n/arb/app_*.arb
Languages: de, es

# createAccountAppBarTitle
source: Create account
de: Konto anlegen
es: Crear una cuenta

# createPasscodeAppBarTitle
source: Create passcode
de: Passwort erstellen
es: Crear código de acceso

# createPasscodeSubTitle
source: Make it ðŸ’ª - Refrain from sequences (123456) and repeated numbers (111234)
de: Machen Sie es 💪 - Verzichten Sie auf Sequenzen (123456) und wiederholte Zahlen (111234)
es: Hazlo 💪 - Abstenerse de secuencias (123456) y números repetidos (111234)

# nameLengthError
source: Name must be at least 2 characters long
de: Name muss mindestens 2 Zeichen lang sein
es: El nombre debe tener al menos 2 caracteres

# nameValidError
source: Name must be a valid string
de: Name muss eine gültige Zeichenfolge sein
es: El nombre debe ser una cadena válida

# emailValidError
source: Email address must have the @ symbol and a dot
de: E-Mail-Adresse muss das @-Symbol und einen Punkt haben
es: La dirección de correo electrónico debe tener el símbolo @ y un punto

# passcodeLengthError
source: Pin code must be 6 digits
de: Der PIN-Code muss 6-stellig sein
es: El código PIN debe tener 6 dígitos

# passcodeDuplicateDigitsError
source: Digits should not repeat themselves more than 2 times
de: Ziffern sollten sich nicht öfter als 2 mal wiederholen
es: Los dígitos no deben repetirse más de 2 veces

# passcodeSequentialDigitsError
source: Passcode should not be a simple sequence
de: Passcode sollte keine einfache Sequenz sein
es: El código de acceso no debe ser una secuencia simple

source: Clear account
de: Konto löschen
es: Borrar cuenta

source: Next
de: Nächste
es: Siguiente

source: Confirm
de: Bestätigen
es: Confirmar

source: Name
es: Nombre

source: Log out
de: Ausloggen
es: Cerrar sesión
